/**
 * Created by liujinghao on 2017/6/22.
 *       {"code":2,"msg":"请登录","result":"\/api\/index\/login"}
 */

var  hsMapData={
    peopleLine:{ // 右下角折线图：截止当前时间的分时段人流量
        xAxis: ['8:00', '9:00', '10:00', '11:00', '12:00', '13:00', '14:00'],
        series: [11, 11, 15, 13, 12, 13, 10]
    },
    // 根据前端传的日期和粒度，返回每个粒度下的人流量 ,以下示例为10分钟
    timeline:[
        {
            date:'2017-06-21 00:00:00', // 请注意此日期格式yyyy-MM-dd hh:mm:ss, 我有时候要当键名查询用，不要乱
            online:5000,// 在园人数预估值
            total:85412,// 截止date时候的当前总入园量
            top10:[  // 人数top10排名，请排序后再返回，需要坐标 ，name值可以不传或者为空，传的话，可以通过浏览器审查元素看到
                {index: 1, name: '皇甫公窟', coor: '112.482578,34.557122'},
                {index: 2, name: '八作司洞', coor: '112.48256,34.55701'},
                {index:3, name: '龙华寺洞', coor: '112.482866,34.557657'} 
            ],
            hot: [  // 当前时间点的热力图数组
                {"lng": 112.485564, "lat": 34.563595, "count": 99},
                {"lng": 112.482093, "lat": 34.556074, "count": 99},
                {"lng": 112.485276, "lat": 34.563387, "count": 80},
            ]
        }  ,
        {
            date: '2017-06-21 00:10:00', // 请注意此日期格式yyyy-MM-dd hh:mm:ss, 我有时候要当键名查询用，不要乱
            online: 5000,// 在园人数预估值
            total: 85412,// 截止date时候的当前总入园量
            top10: [  // 人数top10排名，请排序后再返回，需要坐标 ，name值可以不传或者为空，传的话，可以通过浏览器审查元素看到
                {index: 1, name: '皇甫公窟', coor: '112.482578,34.557122'},
                {index: 2, name: '八作司洞', coor: '112.48256,34.55701'},
                {index: 3, name: '龙华寺洞', coor: '112.482866,34.557657'}
            ],
            hot: [  // 当前时间点的热力图数组格式
                {"lng": 112.485564, "lat": 34.563595, "count": 99},
                {"lng": 112.482093, "lat": 34.556074, "count": 99},
                {"lng": 112.485276, "lat": 34.563387, "count": 80},
            ]
        }
    ]
}
